In [22]:
import numpy as np
import pandas as pd

Loading datasets

In [21]:
#loading customers dataset
df1 = pd.read_csv("customers.csv")

In [23]:
df1

,customer_id,name,email,age,city,join_date
0,1,Customer_1,customer_1@example.com,56,Chicago,2022-08-04
1,2,Customer_2,customer_2@example.com,69,Chicago,2022-09-08
2,3,Customer_3,customer_3@example.com,46,New York,2022-05-06
3,4,Customer_4,customer_4@example.com,32,Phoenix,2022-08-05
4,5,Customer_5,customer_5@example.com,60,Houston,2022-11-02
...,...,...,...,...,...,...
995,996,Customer_996,customer_996@example.com,60,Houston,2023-07-25
996,997,Customer_997,customer_997@example.com,64,Los Angeles,2022-09-04
997,998,Customer_998,customer_998@example.com,62,Houston,2023-10-02
998,999,Customer_999,customer_999@example.com,35,Phoenix,2023-06-21
999,1000,Customer_1000,customer_1000@example.com,55,Los Angeles,2022-05-11

In [24]:
#loading orders datasel
df2 = pd.read_csv("orders.csv")

In [25]:
df2

      order_id  customer_id  order_date product_category  total_price
0            1          353  2023-03-22          Apparel        28.92
1            2          196  2022-03-20      Electronics        72.86
2            3          793  2022-08-24          Apparel       120.07
3            4          916  2022-11-30      Electronics       407.44
4            5          930  2022-12-15          Apparel       440.47
...        ...          ...         ...              ...          ...
4995      4996          884  2023-06-13          Apparel       302.71
4996      4997          753  2022-09-10       Home Goods        88.58
4997      4998          781  2022-05-02       Home Goods       151.80
4998      4999            1  2022-01-10       Home Goods       311.17
4999      5000          546  2022-11-12          Apparel       279.28

[5000 rows x 5 columns]

In [26]:
df1.head(5)

   customer_id        name                   email  age      city   join_date
0            1  Customer_1  customer_1@example.com   56   Chicago  2022-08-04
1            2  Customer_2  customer_2@example.com   69   Chicago  2022-09-08
2            3  Customer_3  customer_3@example.com   46  New York  2022-05-06
3            4  Customer_4  customer_4@example.com   32   Phoenix  2022-08-05
4            5  Customer_5  customer_5@example.com   60   Houston  2022-11-02

In [27]:
df2.head(5)

   order_id  customer_id  order_date product_category  total_price
0         1          353  2023-03-22          Apparel        28.92
1         2          196  2022-03-20      Electronics        72.86
2         3          793  2022-08-24          Apparel       120.07
3         4          916  2022-11-30      Electronics       407.44
4         5          930  2022-12-15          Apparel       440.47

In [10]:
df1.shape    #ROWS AND COLUMNS

(1000, 6)

In [12]:
df2.shape

(5000, 5)

In [13]:
df1.dtypes

customer_id     int64
name           object
email          object
age             int64
city           object
join_date      object
dtype: object

In [14]:
df2.dtypes

order_id              int64
customer_id           int64
order_date           object
product_category     object
total_price         float64
dtype: object

In [15]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   customer_id  1000 non-null   int64
 1   name         1000 non-null   object
 2   email        1000 non-null   object
 3   age          1000 non-null   int64
 4   city         1000 non-null   object
 5   join_date    1000 non-null   object
dtypes: int64(2), object(4)
memory usage: 47.0+ KB

In [16]:
df1.describe()

       customer_id         age
count  1000.000000  1000.00000
mean    500.500000    43.81900
std     288.819436    14.99103
min       1.000000    18.00000
25%     250.750000    31.00000
50%     500.500000    44.00000
75%     750.250000    56.00000
max    1000.000000    69.00000

In [17]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   order_id          5000 non-null   int64
 1   customer_id       5000 non-null   int64
 2   order_date        5000 non-null   object
 3   product_category  5000 non-null   object
 4   total_price       5000 non-null   float64
dtypes: float64(1), int64(2), object(2)
memory usage: 195.4+ KB

In [18]:
df2.describe()

          order_id  customer_id  total_price
count  5000.000000  5000.000000  5000.000000
mean   2500.500000   506.847600   255.472960
std    1443.520003   287.429533   140.919882
min       1.000000     1.000000    10.060000
25%    1250.750000   260.000000   134.140000
50%    2500.500000   506.500000   255.785000
75%    3750.250000   757.000000   374.870000
max    5000.000000  1000.000000   499.950000

**Customer and Order Summary**

In [30]:
# count of unique customers
unique_customer_count = df1['customer_id'].nunique()
unique_customer_count

1000

In [32]:
#list of unique customers
unique_list  = df1['name'].unique()
unique_list

array(['Customer_1', 'Customer_2', 'Customer_3', 'Customer_4',
       'Customer_5', 'Customer_6', 'Customer_7', 'Customer_8',
       'Customer_9', 'Customer_10', 'Customer_11', 'Customer_12',
       'Customer_13', 'Customer_14', 'Customer_15', 'Customer_16',
       'Customer_17', 'Customer_18', 'Customer_19', 'Customer_20',
       'Customer_21', 'Customer_22', 'Customer_23', 'Customer_24',
       'Customer_25', 'Customer_26', 'Customer_27', 'Customer_28',
       'Customer_29', 'Customer_30', 'Customer_31', 'Customer_32',
       'Customer_33', 'Customer_34', 'Customer_35', 'Customer_36',
       'Customer_37', 'Customer_38', 'Customer_39', 'Customer_40',
       'Customer_41', 'Customer_42', 'Customer_43', 'Customer_44',
       'Customer_45', 'Customer_46', 'Customer_47', 'Customer_48',
       'Customer_49', 'Customer_50', 'Customer_51', 'Customer_52',
       'Customer_53', 'Customer_54', 'Customer_55', 'Customer_56',
       'Customer_57', 'Customer_58', 'Customer_59', 'Customer_60',
       'Customer_61', 'Customer_62', 'Customer_63', 'Customer_64',
       'Customer_65', 'Customer_66', 'Customer_67', 'Customer_68',
       'Customer_69', 'Customer_70', 'Customer_71', 'Customer_72',
       'Customer_73', 'Customer_74', 'Customer_75', 'Customer_76',
       'Customer_77', 'Customer_78', 'Customer_79', 'Customer_80',
       'Customer_81', 'Customer_82', 'Customer_83', 'Customer_84',
       'Customer_85', 'Customer_86', 'Customer_87', 'Customer_88',
       'Customer_89', 'Customer_90', 'Customer_91', 'Customer_92',
       'Customer_93', 'Customer_94', 'Customer_95', 'Customer_96',
       'Customer_97', 'Customer_98', 'Customer_99', 'Customer_100',
       'Customer_101', 'Customer_102', 'Customer_103', 'Customer_104',
       'Customer_105', 'Customer_106', 'Customer_107', 'Customer_108',
       'Customer_109', 'Customer_110', 'Customer_111', 'Customer_112',
       'Customer_113', 'Customer_114', 'Customer_115', 'Customer_116',
       'Customer_117', 'Customer_118', 'Customer_119', 'Customer_120',
       'Customer_121', 'Customer_122', 'Customer_123', 'Customer_124',
       'Customer_125', 'Customer_126', 'Customer_127', 'Customer_128',
       'Customer_129', 'Customer_130', 'Customer_131', 'Customer_132',
       'Customer_133', 'Customer_134', 'Customer_135', 'Customer_136',
       'Customer_137', 'Customer_138', 'Customer_139', 'Customer_140',
       'Customer_141', 'Customer_142', 'Customer_143', 'Customer_144',
       'Customer_145', 'Customer_146', 'Customer_147', 'Customer_148',
       'Customer_149', 'Customer_150', 'Customer_151', 'Customer_152',
       'Customer_153', 'Customer_154', 'Customer_155', 'Customer_156',
       'Customer_157', 'Customer_158', 'Customer_159', 'Customer_160',
       'Customer_161', 'Customer_162', 'Customer_163', 'Customer_164',
       'Customer_165', 'Customer_166', 'Customer_167', 'Customer_168',
       'Customer_169', 'Customer_170', 'Customer_171', 'Customer_172',
       'Customer_173', 'Customer_174', 'Customer_175', 'Customer_176',
       'Customer_177', 'Customer_178', 'Customer_179', 'Customer_180',
       'Customer_181', 'Customer_182', 'Customer_183', 'Customer_184',
       'Customer_185', 'Customer_186', 'Customer_187', 'Customer_188',
       'Customer_189', 'Customer_190', 'Customer_191', 'Customer_192',
       'Customer_193', 'Customer_194', 'Customer_195', 'Customer_196',
       'Customer_197', 'Customer_198', 'Customer_199', 'Customer_200',
       'Customer_201', 'Customer_202', 'Customer_203', 'Customer_204',
       'Customer_205', 'Customer_206', 'Customer_207', 'Customer_208',
       'Customer_209', 'Customer_210', 'Customer_211', 'Customer_212',
       'Customer_213', 'Customer_214', 'Customer_215', 'Customer_216',
       'Customer_217', 'Customer_218', 'Customer_219', 'Customer_220',
       'Customer_221', 'Customer_222', 'Customer_223', 'Customer_224',
       'Customer_225', 'Customer_226', 'Customer_227', 'Customer_228',
       'Customer_229', 'Customer_230', 'Customer_231', 'Customer_232',
       'Customer_233', 'Customer_234', 'Customer_235', 'Customer_236',
       'Customer_237', 'Customer_238', 'Customer_239', 'Customer_240',
       'Customer_241', 'Customer_242', 'Customer_243', 'Customer_244',
       'Customer_245', 'Customer_246', 'Customer_247', 'Customer_248',
       'Customer_249', 'Customer_250', 'Customer_251', 'Customer_252',
       'Customer_253', 'Customer_254', 'Customer_255', 'Customer_256',
       'Customer_257', 'Customer_258', 'Customer_259', 'Customer_260',
       'Customer_261', 'Customer_262', 'Customer_263', 'Customer_264',
       'Customer_265', 'Customer_266', 'Customer_267', 'Customer_268',
       'Customer_269', 'Customer_270', 'Customer_271', 'Customer_272',
       'Customer_273', 'Customer_274', 'Customer_275', 'Customer_276',
       'Customer_277', 'Customer_278', 'Customer_279', 'Customer_280',
       'Customer_281', 'Customer_282', 'Customer_283', 'Customer_284',
       'Customer_285', 'Customer_286', 'Customer_287', 'Customer_288',
       'Customer_289', 'Customer_290', 'Customer_291', 'Customer_292',
       'Customer_293', 'Customer_294', 'Customer_295', 'Customer_296',
       'Customer_297', 'Customer_298', 'Customer_299', 'Customer_300',
       'Customer_301', 'Customer_302', 'Customer_303', 'Customer_304',
       'Customer_305', 'Customer_306', 'Customer_307', 'Customer_308',
       'Customer_309', 'Customer_310', 'Customer_311', 'Customer_312',
       'Customer_313', 'Customer_314', 'Customer_315', 'Customer_316',
       'Customer_317', 'Customer_318', 'Customer_319', 'Customer_320',
       'Customer_321', 'Customer_322', 'Customer_323', 'Customer_324',
       'Customer_325', 'Customer_326', 'Customer_327', 'Customer_328',
       'Customer_329', 'Customer_330', 'Customer_331', 'Customer_332',
       'Customer_333', 'Customer_334', 'Customer_335', 'Customer_336',
       'Customer_337', 'Customer_338', 'Customer_339', 'Customer_340',
       'Customer_341', 'Customer_342', 'Customer_343', 'Customer_344',
       'Customer_345', 'Customer_346', 'Customer_347', 'Customer_348',
       'Customer_349', 'Customer_350', 'Customer_351', 'Customer_352',
       'Customer_353', 'Customer_354', 'Customer_355', 'Customer_356',
       'Customer_357', 'Customer_358', 'Customer_359', 'Customer_360',
       'Customer_361', 'Customer_362', 'Customer_363', 'Customer_364',
       'Customer_365', 'Customer_366', 'Customer_367', 'Customer_368',
       'Customer_369', 'Customer_370', 'Customer_371', 'Customer_372',
       'Customer_373', 'Customer_374', 'Customer_375', 'Customer_376',
       'Customer_377', 'Customer_378', 'Customer_379', 'Customer_380',
       'Customer_381', 'Customer_382', 'Customer_383', 'Customer_384',
       'Customer_385', 'Customer_386', 'Customer_387', 'Customer_388',
       'Customer_389', 'Customer_390', 'Customer_391', 'Customer_392',
       'Customer_393', 'Customer_394', 'Customer_395', 'Customer_396',
       'Customer_397', 'Customer_398', 'Customer_399', 'Customer_400',
       'Customer_401', 'Customer_402', 'Customer_403', 'Customer_404',
       'Customer_405', 'Customer_406', 'Customer_407', 'Customer_408',
       'Customer_409', 'Customer_410', 'Customer_411', 'Customer_412',
       'Customer_413', 'Customer_414', 'Customer_415', 'Customer_416',
       'Customer_417', 'Customer_418', 'Customer_419', 'Customer_420',
       'Customer_421', 'Customer_422', 'Customer_423', 'Customer_424',
       'Customer_425', 'Customer_426', 'Customer_427', 'Customer_428',
       'Customer_429', 'Customer_430', 'Customer_431', 'Customer_432',
       'Customer_433', 'Customer_434', 'Customer_435', 'Customer_436',
       'Customer_437', 'Customer_438', 'Customer_439', 'Customer_440',
       'Customer_441', 'Customer_442', 'Customer_443', 'Customer_444',
       'Customer_445', 'Customer_446', 'Customer_447', 'Customer_448',
       'Customer_449', 'Customer_450', 'Customer_451', 'Customer_452',
       'Customer_453', 'Customer_454', 'Customer_455', 'Customer_456',
       'Customer_457', 'Customer_458', 'Customer_459', 'Customer_460',
       'Customer_461', 'Customer_462', 'Customer_463', 'Customer_464',
       'Customer_465', 'Customer_466', 'Customer_467', 'Customer_468',
       'Customer_469', 'Customer_470', 'Customer_471', 'Customer_472',
       'Customer_473', 'Customer_474', 'Customer_475', 'Customer_476',
       'Customer_477', 'Customer_478', 'Customer_479', 'Customer_480',
       'Customer_481', 'Customer_482', 'Customer_483', 'Customer_484',
       'Customer_485', 'Customer_486', 'Customer_487', 'Customer_488',
       'Customer_489', 'Customer_490', 'Customer_491', 'Customer_492',
       'Customer_493', 'Customer_494', 'Customer_495', 'Customer_496',
       'Customer_497', 'Customer_498', 'Customer_499', 'Customer_500',
       'Customer_501', 'Customer_502', 'Customer_503', 'Customer_504',
       'Customer_505', 'Customer_506', 'Customer_507', 'Customer_508',
       'Customer_509', 'Customer_510', 'Customer_511', 'Customer_512',
       'Customer_513', 'Customer_514', 'Customer_515', 'Customer_516',
       'Customer_517', 'Customer_518', 'Customer_519', 'Customer_520',
       'Customer_521', 'Customer_522', 'Customer_523', 'Customer_524',
       'Customer_525', 'Customer_526', 'Customer_527', 'Customer_528',
       'Customer_529', 'Customer_530', 'Customer_531', 'Customer_532',
       'Customer_533', 'Customer_534', 'Customer_535', 'Customer_536',
       'Customer_537', 'Customer_538', 'Customer_539', 'Customer_540',
       'Customer_541', 'Customer_542', 'Customer_543', 'Customer_544',
       'Customer_545', 'Customer_546', 'Customer_547', 'Customer_548',
       'Customer_549', 'Customer_550', 'Customer_551', 'Customer_552',
       'Customer_553', 'Customer_554', 'Customer_555', 'Customer_556',
       'Customer_557', 'Customer_558', 'Customer_559', 'Customer_560',
       'Customer_561', 'Customer_562', 'Customer_563', 'Customer_564',
       'Customer_565', 'Customer_566', 'Customer_567', 'Customer_568',
       'Customer_569', 'Customer_570', 'Customer_571', 'Customer_572',
       'Customer_573', 'Customer_574', 'Customer_575', 'Customer_576',
       'Customer_577', 'Customer_578', 'Customer_579', 'Customer_580',
       'Customer_581', 'Customer_582', 'Customer_583', 'Customer_584',
       'Customer_585', 'Customer_586', 'Customer_587', 'Customer_588',
       'Customer_589', 'Customer_590', 'Customer_591', 'Customer_592',
       'Customer_593', 'Customer_594', 'Customer_595', 'Customer_596',
       'Customer_597', 'Customer_598', 'Customer_599', 'Customer_600',
       'Customer_601', 'Customer_602', 'Customer_603', 'Customer_604',
       'Customer_605', 'Customer_606', 'Customer_607', 'Customer_608',
       'Customer_609', 'Customer_610', 'Customer_611', 'Customer_612',
       'Customer_613', 'Customer_614', 'Customer_615', 'Customer_616',
       'Customer_617', 'Customer_618', 'Customer_619', 'Customer_620',
       'Customer_621', 'Customer_622', 'Customer_623', 'Customer_624',
       'Customer_625', 'Customer_626', 'Customer_627', 'Customer_628',
       'Customer_629', 'Customer_630', 'Customer_631', 'Customer_632',
       'Customer_633', 'Customer_634', 'Customer_635', 'Customer_636',
       'Customer_637', 'Customer_638', 'Customer_639', 'Customer_640',
       'Customer_641', 'Customer_642', 'Customer_643', 'Customer_644',
       'Customer_645', 'Customer_646', 'Customer_647', 'Customer_648',
       'Customer_649', 'Customer_650', 'Customer_651', 'Customer_652',
       'Customer_653', 'Customer_654', 'Customer_655', 'Customer_656',
       'Customer_657', 'Customer_658', 'Customer_659', 'Customer_660',
       'Customer_661', 'Customer_662', 'Customer_663', 'Customer_664',
       'Customer_665', 'Customer_666', 'Customer_667', 'Customer_668',
       'Customer_669', 'Customer_670', 'Customer_671', 'Customer_672',
       'Customer_673', 'Customer_674', 'Customer_675', 'Customer_676',
       'Customer_677', 'Customer_678', 'Customer_679', 'Customer_680',
       'Customer_681', 'Customer_682', 'Customer_683', 'Customer_684',
       'Customer_685', 'Customer_686', 'Customer_687', 'Customer_688',
       'Customer_689', 'Customer_690', 'Customer_691', 'Customer_692',
       'Customer_693', 'Customer_694', 'Customer_695', 'Customer_696',
       'Customer_697', 'Customer_698', 'Customer_699', 'Customer_700',
       'Customer_701', 'Customer_702', 'Customer_703', 'Customer_704',
       'Customer_705', 'Customer_706', 'Customer_707', 'Customer_708',
       'Customer_709', 'Customer_710', 'Customer_711', 'Customer_712',
       'Customer_713', 'Customer_714', 'Customer_715', 'Customer_716',
       'Customer_717', 'Customer_718', 'Customer_719', 'Customer_720',
       'Customer_721', 'Customer_722', 'Customer_723', 'Customer_724',
       'Customer_725', 'Customer_726', 'Customer_727', 'Customer_728',
       'Customer_729', 'Customer_730', 'Customer_731', 'Customer_732',
       'Customer_733', 'Customer_734', 'Customer_735', 'Customer_736',
       'Customer_737', 'Customer_738', 'Customer_739', 'Customer_740',
       'Customer_741', 'Customer_742', 'Customer_743', 'Customer_744',
       'Customer_745', 'Customer_746', 'Customer_747', 'Customer_748',
       'Customer_749', 'Customer_750', 'Customer_751', 'Customer_752',
       'Customer_753', 'Customer_754', 'Customer_755', 'Customer_756',
       'Customer_757', 'Customer_758', 'Customer_759', 'Customer_760',
       'Customer_761', 'Customer_762', 'Customer_763', 'Customer_764',
       'Customer_765', 'Customer_766', 'Customer_767', 'Customer_768',
       'Customer_769', 'Customer_770', 'Customer_771', 'Customer_772',
       'Customer_773', 'Customer_774', 'Customer_775', 'Customer_776',
       'Customer_777', 'Customer_778', 'Customer_779', 'Customer_780',
       'Customer_781', 'Customer_782', 'Customer_783', 'Customer_784',
       'Customer_785', 'Customer_786', 'Customer_787', 'Customer_788',
       'Customer_789', 'Customer_790', 'Customer_791', 'Customer_792',
       'Customer_793', 'Customer_794', 'Customer_795', 'Customer_796',
       'Customer_797', 'Customer_798', 'Customer_799', 'Customer_800',
       'Customer_801', 'Customer_802', 'Customer_803', 'Customer_804',
       'Customer_805', 'Customer_806', 'Customer_807', 'Customer_808',
       'Customer_809', 'Customer_810', 'Customer_811', 'Customer_812',
       'Customer_813', 'Customer_814', 'Customer_815', 'Customer_816',
       'Customer_817', 'Customer_818', 'Customer_819', 'Customer_820',
       'Customer_821', 'Customer_822', 'Customer_823', 'Customer_824',
       'Customer_825', 'Customer_826', 'Customer_827', 'Customer_828',
       'Customer_829', 'Customer_830', 'Customer_831', 'Customer_832',
       'Customer_833', 'Customer_834', 'Customer_835', 'Customer_836',
       'Customer_837', 'Customer_838', 'Customer_839', 'Customer_840',
       'Customer_841', 'Customer_842', 'Customer_843', 'Customer_844',
       'Customer_845', 'Customer_846', 'Customer_847', 'Customer_848',
       'Customer_849', 'Customer_850', 'Customer_851', 'Customer_852',
       'Customer_853', 'Customer_854', 'Customer_855', 'Customer_856',
       'Customer_857', 'Customer_858', 'Customer_859', 'Customer_860',
       'Customer_861', 'Customer_862', 'Customer_863', 'Customer_864',
       'Customer_865', 'Customer_866', 'Customer_867', 'Customer_868',
       'Customer_869', 'Customer_870', 'Customer_871', 'Customer_872',
       'Customer_873', 'Customer_874', 'Customer_875', 'Customer_876',
       'Customer_877', 'Customer_878', 'Customer_879', 'Customer_880',
       'Customer_881', 'Customer_882', 'Customer_883', 'Customer_884',
       'Customer_885', 'Customer_886', 'Customer_887', 'Customer_888',
       'Customer_889', 'Customer_890', 'Customer_891', 'Customer_892',
       'Customer_893', 'Customer_894', 'Customer_895', 'Customer_896',
       'Customer_897', 'Customer_898', 'Customer_899', 'Customer_900',
       'Customer_901', 'Customer_902', 'Customer_903', 'Customer_904',
       'Customer_905', 'Customer_906', 'Customer_907', 'Customer_908',
       'Customer_909', 'Customer_910', 'Customer_911', 'Customer_912',
       'Customer_913', 'Customer_914', 'Customer_915', 'Customer_916',
       'Customer_917', 'Customer_918', 'Customer_919', 'Customer_920',
       'Customer_921', 'Customer_922', 'Customer_923', 'Customer_924',
       'Customer_925', 'Customer_926', 'Customer_927', 'Customer_928',
       'Customer_929', 'Customer_930', 'Customer_931', 'Customer_932',
       'Customer_933', 'Customer_934', 'Customer_935', 'Customer_936',
       'Customer_937', 'Customer_938', 'Customer_939', 'Customer_940',
       'Customer_941', 'Customer_942', 'Customer_943', 'Customer_944',
       'Customer_945', 'Customer_946', 'Customer_947', 'Customer_948',
       'Customer_949', 'Customer_950', 'Customer_951', 'Customer_952',
       'Customer_953', 'Customer_954', 'Customer_955', 'Customer_956',
       'Customer_957', 'Customer_958', 'Customer_959', 'Customer_960',
       'Customer_961', 'Customer_962', 'Customer_963', 'Customer_964',
       'Customer_965', 'Customer_966', 'Customer_967', 'Customer_968',
       'Customer_969', 'Customer_970', 'Customer_971', 'Customer_972',
       'Customer_973', 'Customer_974', 'Customer_975', 'Customer_976',
       'Customer_977', 'Customer_978', 'Customer_979', 'Customer_980',
       'Customer_981', 'Customer_982', 'Customer_983', 'Customer_984',
       'Customer_985', 'Customer_986', 'Customer_987', 'Customer_988',
       'Customer_989', 'Customer_990', 'Customer_991', 'Customer_992',
       'Customer_993', 'Customer_994', 'Customer_995', 'Customer_996',
       'Customer_997', 'Customer_998', 'Customer_999', 'Customer_1000'],
      dtype=object)

2.total revenue generated from all orders

In [34]:
total_revenue = df2['total_price'].sum()
total_revenue

np.float64(1277364.7999999998)

3.average order value

In [36]:
num_orders = df2['order_id'].nunique()
num_orders

5000

In [38]:
avg_customers = total_revenue / num_orders
avg_customers

np.float64(255.47295999999997)

In [40]:
AOV = avg_customers.mean()
AOV

np.float64(255.47295999999997)

**Customer demographic Analysis**

average age of customers in each city

In [43]:
avg_age_by_each_city = df1.groupby('city')['age'].mean()
avg_age_by_each_city

city
Chicago        43.880000
Houston        43.839378
Los Angeles    43.580808
New York       44.404878
Phoenix        43.382353
Name: age, dtype: float64

In [45]:
detailed_stats = df1.groupby('city')['age'].agg(['count',    # number of customers
    'mean',     # average age
    'median',   # median age
    'std',      # standard deviation
    'min',      # minimum age
    'max'       # maximum age
]).round(2)
detailed_stats

             count   mean  median    std  min  max
city
Chicago        200  43.88    45.0  15.56   18   69
Houston        193  43.84    43.0  14.94   18   69
Los Angeles    198  43.58    44.0  14.48   18   69
New York       205  44.40    45.0  15.59   18   69
Phoenix        204  43.38    43.0  14.47   18   69

In [47]:
top_3_basic = df1(['city'].value_counts().head(3)
top_3_basic

city
New York    205
Phoenix     204
Chicago     200
Name: count, dtype: int64

In [50]:
merged_data = pd.merge(df1,df2, on='customer_id', how='inner')
merged_data

,customer_id,name,email,age,city,join_date,order_id,order_date,product_category,total_price
0,1,Customer_1,customer_1@example.com,56,Chicago,2022-08-04,82,2023-03-15,Electronics,388.00
1,1,Customer_1,customer_1@example.com,56,Chicago,2022-08-04,359,2023-06-15,Books,92.51
2,1,Customer_1,customer_1@example.com,56,Chicago,2022-08-04,782,2022-09-08,Books,85.66
3,1,Customer_1,customer_1@example.com,56,Chicago,2022-08-04,1606,2022-09-12,Books,353.96
4,1,Customer_1,customer_1@example.com,56,Chicago,2022-08-04,3004,2022-03-06,Electronics,289.89
...,...,...,...,...,...,...,...,...,...,...
4995,999,Customer_999,customer_999@example.com,35,Phoenix,2023-06-21,2426,2023-10-30,Electronics,287.78
4996,999,Customer_999,customer_999@example.com,35,Phoenix,2023-06-21,3592,2023-03-09,Home Goods,23.57
4997,999,Customer_999,customer_999@example.com,35,Phoenix,2023-06-21,4509,2023-06-09,Apparel,306.97
4998,1000,Customer_1000,customer_1000@example.com,55,Los Angeles,2022-05-11,1675,2023-07-19,Apparel,253.72
4999,1000,Customer_1000,customer_1000@example.com,55,Los Angeles,2022-05-11,3607,2023-06-04,Apparel,271.48

top 3 cities by total number of orders

In [51]:
top_cities = merged_data.groupby('city')['order_id'].count().sort_values(ascending=False).head(3)
top_cities

city
Houston     1019
New York    1015
Phoenix     1009
Name: order_id, dtype: int64

median age of customers who have made at least one order.

In [52]:
#num of customers  order table
customers_with_orders = df2['customer_id'].unique()
customers_with_orders

array([ 353,  196,  793,  916,  930,  666,  382,  645,  227,  701,  476,
        477,  265,  372,  486,  434,  646,  211,  572,  940,  377,  395,
        450,  943,  364,  876,  457,  725,  728,  226,  982,  131,  588,
        798,  986,  277,  156,  760,  218,  190,  417,  981,  675,  692,
        546,   41,  307,  338,  314,   75,  953,  279,  176,  896,  662,
        273,  837,  620,  651,  862,  783,  859,  931,  289,  724,  893,
        272,   66,  483,  936,  248,   47,  935,  454,  201,  660,  124,
          1,  968,  759,  855,  640,  191,  579,  516,  442,  921,  815,
        806,  143,  533,  313,  629,  949,  302,  654,  996,  460,  401,
        551,  393,  867,  764,  845,  207,  210,  115,  737,  251,  219,
        407,  443,  603,  354,  888,  558,  550,  142,  612,  501,  840,
        702,  547,  659,  542,  846,  507,  596,  881,  281,  424,  856,
        270,  154,  614,  727,  944,   83,  622,  947,  899,  426,  275,
        713,  284,  980,  173,  327,  718,   63,   73,  763,  636,  375,
        633,  508,  787,  398,  120,  934,  437,  829,  676,  465,  286,
        320,  673,  376,  820,   89,  203,  821,  739,  955,  334,  222,
        708,   68,  988,  776,  514,  873,  637,  598,  937,  632,  127,
        255,  695,   16,   62,  432,  670,  268,   35,  779,  576,  494,
        562,  469,  767,  661,  325,  304,  276,  869,  963,  684,  929,
        445,  905,  324,  977,  482,  480,   65,    8,  301,  343,  431,
        332,  438,  174,  559,  527,   26,  605,  406,  232,  819,  788,
        505,  669,  179,  132,  823,  455,  348,  540,  772,   76,  941,
        854,  492,  194,  984,  162,  347,  951,  361,  769,  584,   87,
        262,  214,  665,  722,  913,  573,  780,  730,  283,  648,  467,
        380,  362,  449,  441,   93,  621,  753,  291,  749,  852,  824,
        689,  653,  998,   49,  136,  555,  404,  892,  865,  602,  807,
        341,  757,  945,  704,  318,  618,  363,  822,  233,  777,  344,
        549,  817,  553,  529,  789,  571,  183,  397,  907,  333,  557,
        168,   19,  456,  957,  109,  240,  103,  250,  453,  520,  153,
        687,  850,  658,  962,  990,  639,  420,  594,  485,  751,  412,
         84,  113,  378,  755,  655,  770,  959,  797,  105,  202,  843,
        973,  266,  910,  563,  118,  771,  667,  678,  387,  912,  350,
        296,  258,   81,  419,  235,  833,  311,  813,  975,  357,  213,
        574,  223,  408,  294,  796,  107,  611,  429,  634,   30,  188,
        866,  800,  451,  195,  172,  847,   23,  360,  560,  672,  825,
        920,  679,  290,  440,  668,  933,    7,  421,  568,  193,  148,
        444,  914,  427,  479,  475,  126,  392,  688,  628,  204,   31,
        388,  625,  877,  926,  155,  430,  448,  987,  234,  818,  827,
        125,  911,  245,  938,  122,  170,  786,  369,   77,   59,  638,
        500,  736,  278,   69,  165,  489,  305,  909,  674,  365,  379,
        554,  416,  762,  497,  942,  383,  300,  139,  359,  836,  499,
        385,  604,  280,  111,  435,  509,   99,  104,  761,  664,  999,
        853,  517,  657,  613,  164,  886,   64,   91,  117,  267,  685,
        140,  246,  758,  487,  184,   20,  524,  582,  883,  147,  748,
        864,  228,  102,  587,  958,  216,  399,  923,  715,  754,  691,
        974,  731,   82,  903,  163,   48,  511,  329,  116,  849,  337,
        575,  323,   13,  287,  720,  114,   22,  349,  726,  683,  835,
        566,  906,  810,  976,  681,  696,   57,  734,  303,  370,  264,
        794,  488,  647,  292,   25,  141,  744,  901,  128,  257,  703,
        535,  802,  384,  260,  414,  991,  358,  355,  992,   45,  123,
        528,  746,  656,  322,  474,  927,  295,  904,  215,  894,  567,
         27,  630,  733,  231,  565,  321,  781,  403,   53,  544,  446,
         74,   10,  484,  564,  160,  882,   14,  178,  878,  205,  471,
        466,   12,  631,  716,  561,  591,  241,  861,   96,  209,   88,
        390,  889,  832,  157,  577,  619,  137,  428,  452,  177,  198,
        624,  972,  698,  925,  828,  729,  175,  917,  101,  536,  523,
        785,  606,  979,  723,  652,  293,  502,  871,  496,  768,  236,
        741,  100,  898,  649,  166,  459,  952,  993,  263,  804,  274,
          3,   28,  326,  149,  356,  252,  525,   54,  650,   44,  586,
        677,  792,  868,  138,   17,  182,  884,  541,  171,  409,  740,
        858,  230,  119,  784,  795,  693,  682,  699,  745,  134,  391,
         33,   55,  954,  519,  756,  373,  623,  331,  225,  983,  504,
        644,  616,  610,   79,  608,   90,  199,  394,  339,  461,  863,
        971,  491,  700,  569,  159,  686,  242,    5,  946,  422,  738,
         15,  590,  714,  518,  493,  161,  721,  752,   50,  580,  601,
        870,  978,  811,  848,  247,  478,  352,  495,   39,  593,  187,
        600,   86,  548,  512,  872,  790,  129,  961,   58,  315,  890,
        709,  256,  282,  552,  405,  462,  791,  874,  221,  368,  112,
        615,  924,  271,  995,  897,  707,  367,   40,  189,  994,  989,
          4,  433,  181,  581,  254,  830,  680,   85,  317,  212,  515,
        342,  964,  844,   38,  169,  965,  826,  306,  537,  411,  206,
        185,  310,  799,   32,  521,  436,  635,  895,  423,  891,  167,
        418,  340,  308,  880,  192,  851,   43,   78,  801,  900,  902,
        336, 1000,  592,  458,   95,  151,  997,  626,  595,  464,   97,
        197,  694,  526,   29,  831,  570,  468,  425,  583,  778,   98,
        345,  803,  208,  939,  439,  950,  108,  834,  309,  918,  719,
        481,  413,  985,  237,   46,  928,  842,  690,  922,  915,  860,
        366,  299,   61,  503,  319,  589,  970,  750,  490,  857,  956,
        742,  335,   92,  530,  135,  875,  121,   21,  312,   52,  814,
        389,    6,  261,  285,  239,  599,  919,  597,   18,  932,   11,
        330,   71,  269,  765,  144,  534,  732,  532,  960,  671,  220,
        400,  470,  386,  396,  371,  887,  838,   70,  217,   56,  351,
        253,  415,  288,  839,  643,   94,  805,  538,  150,  747,  607,
        885,  743,  808,  110,   60,   36,  642,  238,  145,  735,  106,
        447,  224,  229,   72,  712,  766,  717,  328,  473,    2,  498,
        180,   42,  506,  244,  186,  816,  609,  472,  510,  152,  556,
        578,  948,  663,  585,  543,  774,  710,  146,  249,  381,  966,
        463,  809,  316,  841,  298,  879,  782,   34,    9,  130,  410,
        908,  711,  531,  374,  522,  773,  641,  706,  243,  200,  627,
        513,  259,  967,   67,  705,   37,  158,  297,  402,  617,   24])

In [56]:
#filter customers table to have those customers
active_customers = df1[df1['customer_id'].isin(customers_with_orders)]
active_customers

,customer_id,name,email,age,city,join_date
0,1,Customer_1,customer_1@example.com,56,Chicago,2022-08-04
1,2,Customer_2,customer_2@example.com,69,Chicago,2022-09-08
2,3,Customer_3,customer_3@example.com,46,New York,2022-05-06
3,4,Customer_4,customer_4@example.com,32,Phoenix,2022-08-05
4,5,Customer_5,customer_5@example.com,60,Houston,2022-11-02
...,...,...,...,...,...,...
995,996,Customer_996,customer_996@example.com,60,Houston,2023-07-25
996,997,Customer_997,customer_997@example.com,64,Los Angeles,2022-09-04
997,998,Customer_998,customer_998@example.com,62,Houston,2023-10-02
998,999,Customer_999,customer_999@example.com,35,Phoenix,2023-06-21
999,1000,Customer_1000,customer_1000@example.com,55,Los Angeles,2022-05-11

In [57]:
median_age = active_customers['age'].median()
median_age

np.float64(44.0)

**Product and Revenue Analysis**

 total revenue for each product category

In [58]:
revenue_by_category = df2.groupby('product_category')['total_price'].sum()

print(revenue_by_category)

product_category
Apparel        319685.88
Books          306464.12
Electronics    315515.49
Home Goods     335699.31
Name: total_price, dtype: float64

top 3 product categories by revenue

In [59]:
top_category = revenue_by_category.sort_values(ascending = False).head(3)
top_category

product_category
Home Goods     335699.31
Apparel        319685.88
Electronics    315515.49
Name: total_price, dtype: float64

 total number of orders for each product category

In [60]:
orders_per_category = df2.groupby('product_category')['order_id'].count()

In [61]:
orders_per_category

product_category
Apparel        1235
Books          1203
Electronics    1239
Home Goods     1323
Name: order_id, dtype: int64

**Advanced Customer Behavior Analysis**

In [62]:
customers = df2.groupby('customer_id')['order_id'].count()
customers

customer_id
1       9
2       1
3       5
4       3
5       4
       ..
996     4
997     2
998     3
999     4
1000    2
Name: order_id, Length: 990, dtype: int64

In [63]:
#customers with more than 5 orders
list = customers[customers > 5]
list

customer_id
1       9
6       6
8       6
12      7
13      9
       ..
984     6
986     6
988    10
991     6
992     7
Name: order_id, Length: 390, dtype: int64

In [64]:
#reset index for clean table
active_customers_list = list.reset_index()
active_customers_list.columns = ['customer_id', 'total_orders']

print(active_customers_list)

     customer_id  total_orders
0              1             9
1              6             6
2              8             6
3             12             7
4             13             9
..           ...           ...
385          984             6
386          986             6
387          988            10
388          991             6
389          992             7

[390 rows x 2 columns]

For each month of the year, calculate the total revenue.

In [67]:
# Ensure order_date is datetime
df2['order_date'] = pd.to_datetime(df2['order_date'])
df2['order_date']

0      2023-03-22
1      2022-03-20
2      2022-08-24
3      2022-11-30
4      2022-12-15
          ...
4995   2023-06-13
4996   2022-09-10
4997   2022-05-02
4998   2022-01-10
4999   2022-11-12
Name: order_date, Length: 5000, dtype: datetime64[ns]

In [68]:
# Extract year-month
df2['year_month'] = df2['order_date'].dt.to_period('M')
df2['year_month']

0       2023-03
1       2022-03
2       2022-08
3       2022-11
4       2022-12
         ...
4995    2023-06
4996    2022-09
4997    2022-05
4998    2022-01
4999    2022-11
Name: year_month, Length: 5000, dtype: period[M]

In [69]:
# Group by year_month and sum revenue
monthly_revenue = df2.groupby('year_month')['total_price'].sum()
monthly_revenue

year_month
2022-01    51660.83
2022-02    48645.59
2022-03    59214.04
2022-04    56304.86
2022-05    53122.75
2022-06    54118.21
2022-07    53473.15
2022-08    55460.04
2022-09    49267.99
2022-10    51048.24
2022-11    56021.95
2022-12    47582.06
2023-01    51969.58
2023-02    45671.69
2023-03    54905.58
2023-04    51017.47
2023-05    49037.58
2023-06    55164.97
2023-07    56976.16
2023-08    57901.75
2023-09    54011.55
2023-10    54680.22
2023-11    55287.34
2023-12    54821.20
Freq: M, Name: total_price, dtype: float64

average total_price of orders for customers older than 40.

In [70]:
# Merge customers with orders
merged_data = pd.merge(df1, df2, on='customer_id', how='inner')

In [71]:
# Filter customers older than 40
older_customers_orders = merged_data[merged_data['age'] > 40]
older_customers_orders

,customer_id,name,email,age,city,join_date,order_id,order_date,product_category,total_price,year_month
0,1,Customer_1,customer_1@example.com,56,Chicago,2022-08-04,82,2023-03-15,Electronics,388.00,2023-03
1,1,Customer_1,customer_1@example.com,56,Chicago,2022-08-04,359,2023-06-15,Books,92.51,2023-06
2,1,Customer_1,customer_1@example.com,56,Chicago,2022-08-04,782,2022-09-08,Books,85.66,2022-09
3,1,Customer_1,customer_1@example.com,56,Chicago,2022-08-04,1606,2022-09-12,Books,353.96,2022-09
4,1,Customer_1,customer_1@example.com,56,Chicago,2022-08-04,3004,2022-03-06,Electronics,289.89,2022-03
...,...,...,...,...,...,...,...,...,...,...,...
4991,998,Customer_998,customer_998@example.com,62,Houston,2023-10-02,313,2023-01-01,Apparel,257.92,2023-01
4992,998,Customer_998,customer_998@example.com,62,Houston,2023-10-02,475,2022-12-23,Electronics,181.50,2022-12
4993,998,Customer_998,customer_998@example.com,62,Houston,2023-10-02,3072,2022-02-22,Home Goods,469.47,2022-02
4998,1000,Customer_1000,customer_1000@example.com,55,Los Angeles,2022-05-11,1675,2023-07-19,Apparel,253.72,2023-07
4999,1000,Customer_1000,customer_1000@example.com,55,Los Angeles,2022-05-11,3607,2023-06-04,Apparel,271.48,2023-06

In [72]:
# average total_price
avg_price_over_40 = older_customers_orders['total_price'].mean()
avg_price_over_40

np.float64(253.7098784300104)